app/controllers/grains_controller.rb

SELECT "grains".* FROM "grains"
---
  def index
    @grains = Grain.all

INSERT INTO "grains" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test"], ["created_at", "2020-05-20 23:13:36.771208"], ["updated_at", "2020-05-20 23:13:36.771208"]]
---
  def create
    @grain = Grain.new(grain_params)

    if @grain.save

DELETE FROM "grains" WHERE "grains"."id" = $1  [["id", 3]]
---
  def destroy
    @grain.destroy

SELECT "grains".* FROM "grains" WHERE "grains"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_grain
      @grain = Grain.find(params[:id])