app/controllers/hops_controller.rb

SELECT "hops".* FROM "hops"
---
  def index
    @hops = Hop.all

INSERT INTO "hops" ("name", "origin", "alpha", "beta", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @hop = Hop.new(hop_params)

    if @hop.save

DELETE FROM "hops" WHERE "hops"."id" = $1  [["id", 3]]
---
  def destroy
    @hop.destroy

SELECT "hops".* FROM "hops" WHERE "hops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_hop
      @hop = Hop.find(params[:id])