app/controllers/recipe_style_ledgers_controller.rb

SELECT "recipe_style_ledgers".* FROM "recipe_style_ledgers"
---
  def index
    @recipe_style_ledgers = RecipeStyleLedger.all

INSERT INTO "recipe_style_ledgers" ("recipe_id", "style_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 9], ["style_id", 1], ["created_at", "2020-05-25 15:47:23.691528"], ["updated_at", "2020-05-25 15:47:23.691528"]]
---
  def create
    @recipe_style_ledger = RecipeStyleLedger.new(recipe_style_ledger_params)

    if @recipe_style_ledger.save

DELETE FROM "recipe_style_ledgers" WHERE "recipe_style_ledgers"."id" = $1  [["id", 12]]
---
  def destroy
    @recipe_style_ledger.destroy

SELECT "recipe_style_ledgers".* FROM "recipe_style_ledgers" WHERE "recipe_style_ledgers"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def set_recipe_style_ledger
      @recipe_style_ledger = RecipeStyleLedger.find(params[:id])