app/controllers/recipe_grain_ledgers_controller.rb

SELECT "recipe_grain_ledgers".* FROM "recipe_grain_ledgers"
---
  def index
    @recipe_grain_ledgers = RecipeGrainLedger.all

INSERT INTO "recipe_grain_ledgers" ("recipe_id", "grain_id", "qty", "created_at", "updated_at", "percentage") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe_id", 9], ["grain_id", 1], ["qty", "1.0"], ["created_at", "2020-05-25 15:47:23.792785"], ["updated_at", "2020-05-25 15:47:23.792785"], ["percentage", "2.0"]]
---
  def create
    @recipe_grain_ledger = RecipeGrainLedger.new(recipe_grain_ledger_params)

    if @recipe_grain_ledger.save

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 10]]
DELETE FROM "recipe_grain_ledgers" WHERE "recipe_grain_ledgers"."id" = $1  [["id", 32]]
---
  def destroy
    @recipe_grain_ledger.destroy

SELECT "recipe_grain_ledgers".* FROM "recipe_grain_ledgers" WHERE "recipe_grain_ledgers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_recipe_grain_ledger
      @recipe_grain_ledger = RecipeGrainLedger.find(params[:id])