app/controllers/recipe_hop_ledgers_controller.rb

SELECT "recipe_hop_ledgers".* FROM "recipe_hop_ledgers"
---
  def index
    @recipe_hop_ledgers = RecipeHopLedger.all

INSERT INTO "recipe_hop_ledgers" ("recipe_id", "hop_id", "qty", "created_at", "updated_at", "time") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["recipe_id", 15], ["hop_id", 4], ["qty", "2.0"], ["created_at", "2020-05-25 16:38:42.230083"], ["updated_at", "2020-05-25 16:38:42.230083"], ["time", 60]]
---
  def create
    @recipe_hop_ledger = RecipeHopLedger.new(recipe_hop_ledger_params)

    if @recipe_hop_ledger.save

DELETE FROM "recipe_hop_ledgers" WHERE "recipe_hop_ledgers"."id" = $1  [["id", 8]]
---
  def destroy
    @recipe_hop_ledger.destroy

SELECT "recipe_hop_ledgers".* FROM "recipe_hop_ledgers" WHERE "recipe_hop_ledgers"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_recipe_hop_ledger
      @recipe_hop_ledger = RecipeHopLedger.find(params[:id])