app/controllers/recipe_yeast_ledgers_controller.rb

SELECT "recipe_yeast_ledgers".* FROM "recipe_yeast_ledgers"
---
  def index
    @recipe_yeast_ledgers = RecipeYeastLedger.all

INSERT INTO "recipe_yeast_ledgers" ("recipe_id", "yeast_id", "qty", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 11], ["yeast_id", 3], ["qty", "1.0"], ["created_at", "2020-05-25 16:20:03.238902"], ["updated_at", "2020-05-25 16:20:03.238902"]]
---
  def create
    @recipe_yeast_ledger = RecipeYeastLedger.new(recipe_yeast_ledger_params)

    if @recipe_yeast_ledger.save

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 12]]
DELETE FROM "recipe_yeast_ledgers" WHERE "recipe_yeast_ledgers"."id" = $1  [["id", 11]]
---
  def destroy
    @recipe_yeast_ledger.destroy

SELECT "recipe_yeast_ledgers".* FROM "recipe_yeast_ledgers" WHERE "recipe_yeast_ledgers"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    def set_recipe_yeast_ledger
      @recipe_yeast_ledger = RecipeYeastLedger.find(params[:id])