app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "volume", "efficiency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test Recipe"], ["volume", "6.5"], ["efficiency", "68"], ["created_at", "2020-05-25 14:19:29.326350"], ["updated_at", "2020-05-25 14:19:29.326350"]]