app/controllers/styles_controller.rb

  def index
    @styles = Style.all
---
SELECT "styles".* FROM "styles"

  def create
    @style = Style.new(style_params)

    if @style.save
---
INSERT INTO "styles" ("name", "overview", "ibu_low", "ibu_high", "srm_low", "srm_high", "og_low", "og_high", "fg_low", "fg_high", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def destroy
    @style.destroy
---
DELETE FROM "styles" WHERE "styles"."id" = $1  [["id", 1]]

    def set_style
      @style = Style.find(params[:id])
---
SELECT "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]