app/controllers/yeasts_controller.rb

  def index
    @yeasts = Yeast.all
---
SELECT "yeasts".* FROM "yeasts"

  def create
    @yeast = Yeast.new(yeast_params)

    if @yeast.save
---
INSERT INTO "yeasts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test"], ["created_at", "2020-05-20 23:06:40.912093"], ["updated_at", "2020-05-20 23:06:40.912093"]]

  def destroy
    @yeast.destroy
---
DELETE FROM "yeasts" WHERE "yeasts"."id" = $1  [["id", 4]]

    def set_yeast
      @yeast = Yeast.find(params[:id])
---
SELECT "yeasts".* FROM "yeasts" WHERE "yeasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]